
#ifndef CrcUnitH
#define CrcUnitH
//================================================================================

#include "Integer.h"
//================================================================================

extern const DWORD Crc32Table[256];
extern const WORD Crc16Table[256];
extern const BYTE Crc8Table[256];
//================================================================================

// расчет CRC32 для блока данных, CRC-32 IEEE (Polynom = 0x104C11DB7)
// вход: адрес буфера, размер данных в байтах
// выход: CRC32
DWORD CalcCrc32 (void *Buffer, int Size);

// расчет CRC16 для блока данных, CRC-16 CCITT (Polynom = 0x11021)
// вход: адрес буфера, размер данных в байтах
// выход: CRC16
WORD CalcCrc16 (void *Buffer, int Size);

// расчет CRC8 для блока данных, CRC-8 CCITT (Polynom = 0x18D)
// вход: адрес буфера, размер данных в байтах
// выход: CRC8
BYTE CalcCrc8 (void *Buffer, int Size);

// расчет контрольной суммы по алгоритму CSumLong (Субмикрон) 
// вход: предыдущее значение суммы (расчет начинается с 0), слово данных для расчета новой суммы (размер блока д.б. кратен 4)
// выход: новое значение суммы
DWORD CSumLong (DWORD Sum, DWORD Word);
//================================================================================

u32 CalcCrc32Init (void);
u32 CalcCrc32Block (u32 Crc32, void *Buffer, u32 Size);
u32 CalcCrc32Done (u32 Crc32);
//================================================================================

#endif

